#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mdata.aws_iam_policy_document.vpc_flowlog_policy: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.assume_role: Reading...[0m[0m
[0m[1maws_vpc.this: Refreshing state... [id=vpc-0870bffca2421a1e1][0m
[0m[1mdata.aws_iam_policy_document.assume_role: Read complete after 0s [id=3760307347][0m
[0m[1mdata.aws_iam_policy_document.vpc_flowlog_policy: Read complete after 0s [id=3442509011][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_cloudwatch_log_group.cw_loggroup[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "cw_loggroup" {
      [32m+[0m [0m[1m[0marn[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m              = "example"
      [32m+[0m [0m[1m[0mretention_in_days[0m[0m = 0
      [32m+[0m [0m[1m[0mtags_all[0m[0m          = (known after apply)
    }

[1m  # aws_flow_log.app1[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_flow_log" "app1" {
      [32m+[0m [0m[1m[0marn[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0miam_role_arn[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mlog_destination[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlog_destination_type[0m[0m     = "cloud-watch-logs"
      [32m+[0m [0m[1m[0mlog_format[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mlog_group_name[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mmax_aggregation_interval[0m[0m = 600
      [32m+[0m [0m[1m[0mtags_all[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mtraffic_type[0m[0m             = "ALL"
      [32m+[0m [0m[1m[0mvpc_id[0m[0m                   = "vpc-0870bffca2421a1e1"
    }

[1m  # aws_iam_role.vpc_flowlog_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role" "vpc_flowlog_role" {
      [32m+[0m [0m[1m[0marn[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0massume_role_policy[0m[0m    = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction    = "sts:AssumeRole"
                      [32m+[0m [0mEffect    = "Allow"
                      [32m+[0m [0mPrincipal = {
                          [32m+[0m [0mService = "vpc-flow-logs.amazonaws.com"
                        }
                      [32m+[0m [0mSid       = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mcreate_date[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mforce_detach_policies[0m[0m = false
      [32m+[0m [0m[1m[0mid[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mmanaged_policy_arns[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mmax_session_duration[0m[0m  = 3600
      [32m+[0m [0m[1m[0mname[0m[0m                  = "vpc_flowlog_role"
      [32m+[0m [0m[1m[0mname_prefix[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mpath[0m[0m                  = "/"
      [32m+[0m [0m[1m[0mtags_all[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0munique_id[0m[0m             = (known after apply)

      [32m+[0m [0minline_policy {
          [32m+[0m [0m[1m[0mname[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mpolicy[0m[0m = (known after apply)
        }
    }

[1m  # aws_iam_role_policy.vpc_flowlog_role[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_iam_role_policy" "vpc_flowlog_role" {
      [32m+[0m [0m[1m[0mid[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m   = "vpc_flowlog_role"
      [32m+[0m [0m[1m[0mpolicy[0m[0m = jsonencode(
            {
              [32m+[0m [0mStatement = [
                  [32m+[0m [0m{
                      [32m+[0m [0mAction   = [
                          [32m+[0m [0m"logs:PutLogEvents",
                          [32m+[0m [0m"logs:DescribeLogStreams",
                          [32m+[0m [0m"logs:DescribeLogGroups",
                          [32m+[0m [0m"logs:CreateLogStream",
                          [32m+[0m [0m"logs:CreateLogGroup",
                        ]
                      [32m+[0m [0mEffect   = "Allow"
                      [32m+[0m [0mResource = "*"
                      [32m+[0m [0mSid      = ""
                    },
                ]
              [32m+[0m [0mVersion   = "2012-10-17"
            }
        )
      [32m+[0m [0m[1m[0mrole[0m[0m   = (known after apply)
    }

[0m[1mPlan:[0m 4 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kunduso-aws, Action: `pull_request`*